#+TITLE:CSC 100.01 - Introduction to Programming, Spring 2023 Syllabus
#+AUTHOR: Marcus Birkenkrahe
#+options: toc:nil
#+startup: overview indent
** Grading system

| REQUIREMENT            | UNITS | PPU | TOTAL | % of TOTAL |
|------------------------+-------+-----+-------+------------|
| Final exam             |     1 | 100 |   100 |        20. |
| Home assignments       |    10 |  10 |   100 |        20. |
| Class assignments      |    10 |  10 |   100 |        20. |
| Project sprint reviews |     5 |  20 |   100 |        20. |
| Multiple-choice tests  |    10 |  10 |   100 |        20. |
|------------------------+-------+-----+-------+------------|
| TOTAL                  |       |     |   500 |       100. |
|------------------------+-------+-----+-------+------------|
#+TBLFM: @2$4=$2*$3::@2$5=(@2$4/@7$4)*100::@3$4=$2*$3::@3$5=(@3$4/@7$4)*100::@4$4=$2*$3::@4$5=(@4$4/@7$4)*100::@5$4=$2*$3::@5$5=(@5$4/@7$4)*100::@6$5=(@6$4/@7$4)*100::@7$4=vsum(@2..@6)::@7$5=vsum(@2..@6)

You should be able to see your current grade at any time using the
Canvas gradebook for the course.

